
&НаСервере
Процедура ПриОткрытииНаСервере()
	ДатаОткрытия = ТекущаяДата();
	ЗапросФИО = Новый Запрос();
	ЗапросФИО.УстановитьПараметр("КонецПериода", ДатаОткрытия);
	ЗапросФИО.УстановитьПараметр("ФизическоеЛицо", Объект.Ссылка);
	ЗапросФИО.Текст = "ВЫБРАТЬ
	          |	ФИОСрезПоследних.Фамилия КАК Фамилия,
	          |	ФИОСрезПоследних.Имя КАК Имя,
	          |	ФИОСрезПоследних.Отчество КАК Отчество
	          |ИЗ
	          |	РегистрСведений.ФИО.СрезПоследних(&КонецПериода) КАК ФИОСрезПоследних
	          |ГДЕ
	          |	ФИОСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
	ВыборкаФИО = ЗапросФИО.Выполнить().Выбрать();
	ВыборкаФИО.Следующий();
    Фамилия = ВыборкаФИО.Фамилия;
	Имя = ВыборкаФИО.Имя;
	Отчество = ВыборкаФИО.Отчество;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ) 	
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриЗаписиНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	ЗапросФИО = Новый Запрос();
	ЗапросФИО.УстановитьПараметр("КонецПериода", ДатаОткрытия);
	ЗапросФИО.УстановитьПараметр("ФизическоеЛицо", Объект.Ссылка);
	ЗапросФИО.Текст = "ВЫБРАТЬ
	          |	ФИОСрезПоследних.Фамилия КАК Фамилия,
	          |	ФИОСрезПоследних.Имя КАК Имя,
	          |	ФИОСрезПоследних.Отчество КАК Отчество
	          |ИЗ
	          |	РегистрСведений.ФИО.СрезПоследних(&КонецПериода) КАК ФИОСрезПоследних
	          |ГДЕ
	          |	ФИОСрезПоследних.ФизическоеЛицо = &ФизическоеЛицо";
	ВыборкаФИО = ЗапросФИО.Выполнить().Выбрать();
	ВыборкаФИО.Следующий();
	Если ВыборкаФИО.Фамилия <> Фамилия Или 
		ВыборкаФИО.Имя <> Имя Или 
		ВыборкаФИО.Отчество <> Отчество Тогда 
		МенеджерЗаписи = РегистрыСведений.ФИО.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.ФизическоеЛицо = ТекущийОбъект.Ссылка;
		МенеджерЗаписи.Период = ДатаОткрытия;
		МенеджерЗаписи.Фамилия = Фамилия;
		МенеджерЗаписи.Имя = Имя;
		МенеджерЗаписи.Отчество = Отчество;
		МенеджерЗаписи.Записать();
	КонецЕсли;
КонецПроцедуры
