
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ОтметитьОбязательныеПоля();
КонецПроцедуры

&НаКлиенте
Процедура ВидПриИзменении(Элемент)
	ОтметитьОбязательныеПоля();
КонецПроцедуры

&НаКлиенте
Процедура ОтметитьОбязательныеПоля()                    
	Если ПроверитьЯвляетсяДоговором() Тогда
	  Элементы.Контрагент.ОтметкаНезаполненного = Истина;
	  Элементы.КонтактноеЛицоКонтрагента.ОтметкаНезаполненного = Истина;
	Иначе
	  Элементы.Контрагент.ОтметкаНезаполненного = Ложь;
	  Элементы.КонтактноеЛицоКонтрагента.ОтметкаНезаполненного = Ложь;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Функция ПроверитьЯвляетсяДоговором()
	Возврат Объект.Вид.ЯвлеяетсяДоговором
КонецФункции