
Процедура ПередЗаписью(Отказ)  
	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если не Пользователь = Неопределено Тогда 
		Возврат;
	КонецЕсли;
	НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
	НовыйПользователь.Имя = Наименование;
	НовыйПользователь.ПолноеИмя = Наименование;
	Для Каждого РольВСправочнике из Роли Цикл
		Роль = Метаданные.Роли.Найти(РольВСправочнике.Роль);
		НовыйПользователь.Роли.Добавить(Роль);
	КонецЦикла; 
	НовыйПользователь.Записать();
	Идентификатор = НовыйПользователь.УникальныйИдентификатор;
КонецПроцедуры

Процедура ПередУдалением(Отказ) 
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Идентификатор);
	Если не Пользователь = Неопределено Тогда 	
		Пользователь.Удалить();
	КонецЕсли;
КонецПроцедуры
