
Процедура ПередЗаписью(Отказ)
	Если ПустаяСтрока(Наименование) Тогда
    	Отказ = Истина;
    	Возврат;
	КонецЕсли;

	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если Пользователь = Неопределено Тогда  
		НовыйПользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		НовыйПользователь.Имя = Наименование;
		НовыйПользователь.ПолноеИмя = Наименование;
		Для Каждого РольВСправочнике из Роли Цикл
			Роль = Метаданные.Роли.Найти(РольВСправочнике.Роль);
			НовыйПользователь.Роли.Добавить(Роль);
		КонецЦикла; 
		НовыйПользователь.Записать();
		Идентификатор = НовыйПользователь.УникальныйИдентификатор;
	КонецЕсли;
КонецПроцедуры

Процедура ПередУдалением(Отказ) 
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Идентификатор);
	Если не Пользователь = Неопределено Тогда 	
		Пользователь.Удалить();
	КонецЕсли;
КонецПроцедуры
