
Процедура ПередЗаписью(Отказ)
	Если ПустаяСтрока(Наименование) Тогда
    	Отказ = Истина;
    	Возврат;
	КонецЕсли;

	Пользователь = ПользователиИнформационнойБазы.НайтиПоИмени(Наименование);
	Если Пользователь = Неопределено Тогда  
		Пользователь = ПользователиИнформационнойБазы.СоздатьПользователя();
		Пользователь.Имя = Наименование;
		Пользователь.ПолноеИмя = Наименование;
	КонецЕсли; 	
	
	Для Каждого Роль из Пользователь.Роли Цикл
		РольВСправочнике = Роли.Найти(Роль);
		Если  РольВСправочнике = Неопределено Тогда
			Пользователь.Роли.Удалить(Роль);
		КонецЕсли;
	КонецЦикла;
	
	Для Каждого РольВСправочнике из Роли Цикл 
		Роль = Метаданные.Роли.Найти(РольВСправочнике.Роль); 	
		Пользователь.Роли.Добавить(Роль);
	КонецЦикла;
	
	Пользователь.Записать();
	Идентификатор = Пользователь.УникальныйИдентификатор;
КонецПроцедуры

Процедура ПередУдалением(Отказ) 
	Пользователь = ПользователиИнформационнойБазы.НайтиПоУникальномуИдентификатору(Идентификатор);
	Если не Пользователь = Неопределено Тогда 	
		Пользователь.Удалить();
	КонецЕсли;
КонецПроцедуры
