
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ТекущийПользователь = ПользователиИнформационнойБазы.ТекущийПользователь();
	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Идентификатор", ТекущийПользователь.УникальныйИдентификатор);
	Если Пользователь.Пустая() Тогда
		ПользовательВСправочнике = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательВСправочнике.Идентификатор = ТекущийПользователь.УникальныйИдентификатор;
		ПользовательВСправочнике.Наименование = ИмяПользователя();
		Для каждого Роль из ТекущийПользователь.Роли Цикл 
			РольВСправочнике = ПользовательВСправочнике.Роли.Добавить();
 			ЭлементПеречисления = Перечисления.Роли.ПолучитьДанныеВыбора(Новый Структура("СтрокаПоиска", Строка(Роль)))[0];
			РольВСправочнике.Роль = ЭлементПеречисления.Значение.Значение;
		КонецЦикла;
		ПользовательВСправочнике.Записать();
		Пользователь = ПользовательВСправочнике.Ссылка;
	КонецЕсли; 
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
КонецПроцедуры
