
Процедура УстановкаПараметровСеанса(ТребуемыеПараметры)
	ТекущийПользовательИБ = ПользователиИнформационнойБазы.ТекущийПользователь();
	Если ПараметрыСеанса.РазделительИспользование = Ложь Тогда 
		Возврат;
	КонецЕсли;

	Пользователь = Справочники.Пользователи.НайтиПоРеквизиту("Идентификатор", ТекущийПользовательИБ.УникальныйИдентификатор);
	Если Пользователь.Пустая() Тогда
		ПользовательВСправочнике = Справочники.Пользователи.СоздатьЭлемент();
		ПользовательВСправочнике.Идентификатор = ТекущийПользовательИБ.УникальныйИдентификатор;
		ПользовательВСправочнике.Наименование = ИмяПользователя();
		Для каждого Роль из ТекущийПользовательИБ.Роли Цикл 
			РольВСправочнике = ПользовательВСправочнике.Роли.Добавить();
			РольВСправочнике.Роль = Перечисления.Роли[Строка(Роль)];
		КонецЦикла;
		ПользовательВСправочнике.Записать();
		Пользователь = ПользовательВСправочнике.Ссылка;
	КонецЕсли; 
	ПараметрыСеанса.ТекущийПользователь = Пользователь;
КонецПроцедуры
