
Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	Автор = ПараметрыСеанса.ТекущийПользователь;
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)
	// регистр ЗатратыПоПроектам Приход
	Сумма = 0;
	Движения.ЗатратыПоПроектам.Записывать = Истина;
	Для Каждого СтатьяЗатрат Из СтатьиЗатрат Цикл
		 Сумма = Сумма + СтатьяЗатрат.СуммаРасходов;
	КонецЦикла;
	Движение = Движения.ЗатратыПоПроектам.Добавить();
	Движение.ВидДвижения = ВидДвиженияНакопления.Приход;
	Движение.Период = Дата;
	Движение.Затраты = Сумма;
	Движение.Организация = Организация;
	Движение.Автор = Автор;
	Движение.Проект = Проект;
КонецПроцедуры
