&НаКлиенте
Процедура ДобавитьФайл(Команда)
	Оповещение  =  Новый ОписаниеОповещения("ВыборФайлаЗавершение", ЭтаФорма);
	НачатьПомещениеФайлаНаСервер(Оповещение,,,,, УникальныйИдентификатор);
КонецПроцедуры

&НаКлиенте
Процедура ВыборФайлаЗавершение(ОписаниеФайла, Параметр2) Экспорт
	Предпросмотр = ОписаниеФайла.Адрес;
 	Объект.Расширение = ОписаниеФайла.СсылкаНаФайл.Расширение;
КонецПроцедуры


&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	Если ЭтоАдресВременногоХранилища(Предпросмотр) тогда
		ТекущийОбъект.Файл = Новый ХранилищеЗначения(ПолучитьИзВременногоХранилища(Предпросмотр)); 	
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Предпросмотр = ПолучитьНавигационнуюСсылку(Объект.Ссылка, "Файл"); 
КонецПроцедуры




